In [13]:
import sqlite3 as s
import pandas as pd

In [14]:
conn = s.connect('database.sqlite')

print("table created successfully");

table created successfully

In [15]:
table1 = pd.read_sql('''SELECT * FROM sqlite_master;''', conn)
print(table1)

     type                               name         tbl_name  rootpage  \
0   table                             Player           Player         2
1   table                         Extra_Runs       Extra_Runs         3
2   index      sqlite_autoindex_Extra_Runs_1       Extra_Runs         4
3   table                     Batsman_Scored   Batsman_Scored         7
4   index  sqlite_autoindex_Batsman_Scored_1   Batsman_Scored         8
5   table                      Batting_Style    Batting_Style        10
6   table                      Bowling_Style    Bowling_Style        11
7   table                            Country          Country        12
8   table                             Season           Season        14
9   table                               City             City        15
10  table                            Outcome          Outcome        16
11  table                             Win_By           Win_By        17
12  table                       Wicket_Taken     Wicket_Taken        18
13  index    sqlite_autoindex_Wicket_Taken_1     Wicket_Taken        19
14  table                              Venue            Venue        21
15  table                         Extra_Type       Extra_Type        23
16  table                           Out_Type         Out_Type        24
17  table                      Toss_Decision    Toss_Decision        25
18  table                             Umpire           Umpire        26
19  table                               Team             Team        27
20  table                       Ball_by_Ball     Ball_by_Ball        28
21  index    sqlite_autoindex_Ball_by_Ball_1     Ball_by_Ball        29
22  table                        sysdiagrams      sysdiagrams        31
23  table                    sqlite_sequence  sqlite_sequence        32
24  index      sysdiagrams_UK_principal_name      sysdiagrams        33
25  table                              Match            Match        34
26  table                              Rolee            Rolee        36
27  table                       Player_Match     Player_Match        37
28  index    sqlite_autoindex_Player_Match_1     Player_Match        38

                                                  sql
0   CREATE TABLE [Player] (\n\t[Player_Id]\tintege...
1   CREATE TABLE [Extra_Runs] (\n\t[Match_Id]\tint...
2                                                None
3   CREATE TABLE [Batsman_Scored] (\n\t[Match_Id]\...
4                                                None
5   CREATE TABLE [Batting_Style] (\n\t[Batting_Id]...
6   CREATE TABLE [Bowling_Style] (\n\t[Bowling_Id]...
7   CREATE TABLE [Country] (\n\t[Country_Id]\tinte...
8   CREATE TABLE [Season] (\n\t[Season_Id]\tintege...
9   CREATE TABLE [City] (\n\t[City_Id]\tinteger NO...
10  CREATE TABLE [Outcome] (\n\t[Outcome_Id]\tinte...
11  CREATE TABLE [Win_By] (\n\t[Win_Id]\tinteger N...
12  CREATE TABLE [Wicket_Taken] (\n\t[Match_Id]\ti...
13                                               None
14  CREATE TABLE [Venue] (\n\t[Venue_Id]\tinteger ...
15  CREATE TABLE [Extra_Type] (\n\t[Extra_Id]\tint...
16  CREATE TABLE [Out_Type] (\n\t[Out_Id]\tinteger...
17  CREATE TABLE [Toss_Decision] (\n\t[Toss_Id]\ti...
18  CREATE TABLE [Umpire] (\n\t[Umpire_Id]\tintege...
19  CREATE TABLE [Team] (\n\t[Team_Id]\tinteger NO...
20  CREATE TABLE [Ball_by_Ball] (\n\t[Match_Id]\ti...
21                                               None
22  CREATE TABLE [sysdiagrams] (\n\t[name]\tnvarch...
23             CREATE TABLE sqlite_sequence(name,seq)
24  CREATE UNIQUE INDEX [sysdiagrams_UK_principal_...
25  CREATE TABLE [Match] (\n\t[Match_Id]\tinteger ...
26  CREATE TABLE [Rolee] (\n\t[Role_Id]\tinteger N...
27  CREATE TABLE [Player_Match] (\n\t[Match_Id]\ti...
28                                               None

In [18]:
P=pd.read_sql('''SELECT * FROM City;''', conn)
print(P)

    City_Id       City_Name  Country_id
0         1       Bangalore           1
1         2      Chandigarh           1
2         3           Delhi           1
3         4          Mumbai           1
4         5         Kolkata           1
5         6          Jaipur           1
6         7       Hyderabad           1
7         8         Chennai           1
8         9       Cape Town           2
9        10  Port Elizabeth           2
10       11          Durban           2
11       12       Centurion           2
12       13     East London           2
13       14    Johannesburg           2
14       15       Kimberley           2
15       16    Bloemfontein           2
16       17       Ahmedabad           1
17       18         Cuttack           1
18       19          Nagpur           1
19       20      Dharamsala           1
20       21           Kochi           1
21       22          Indore           1
22       23   Visakhapatnam           1
23       24            Pune           1
24       25          Raipur           1
25       26          Ranchi           1
26       27       Abu Dhabi           3
27       28          Rajkot           1
28       29          Kanpur           1

In [19]:
print(P.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City_Id     29 non-null     int64
 1   City_Name   29 non-null     object
 2   Country_id  29 non-null     int64
dtypes: int64(2), object(1)
memory usage: 824.0+ bytes
None

In [8]:
# Example: Fetch data from a table
cursor.execute("SELECT * FROM Table1")
data = cursor.fetchall()

In [20]:

t=pd.read_sql('''SELECT * FROM MATCH WHERE MATCH_WINNER ==1;''', conn)
print(t)

    Match_Id  Team_1  Team_2           Match_Date  Season_Id  Venue_Id  \
0     335987       2       1  2008-04-18 00:00:00          1         1
1     335991       1       8  2008-04-20 00:00:00          1         5
2     336015       1       2  2008-05-08 00:00:00          1         5
3     336019       8       1  2008-05-11 00:00:00          1         7
4     336022       1       6  2008-05-13 00:00:00          1         5
..       ...     ...     ...                  ...        ...       ...
63    980944      12       1  2016-04-24 00:00:00          9        32
64    980964       2       1  2016-05-02 00:00:00          9         1
65    980968       1       4  2016-05-04 00:00:00          9         5
66    980994       1      12  2016-05-14 00:00:00          9         5
67    981014       1      11  2016-05-22 00:00:00          9         5

    Toss_Winner  Toss_Decide  Win_Type  Win_Margin  Outcome_type  \
0             2            1         1         140             1
1             8            2         2           5             1
2             1            2         1           5             1
3             1            2         1          23             1
4             1            2         1          23             1
..          ...          ...       ...         ...           ...
63            1            1         2           2             1
64            1            1         2           5             1
65            4            1         1           7             1
66           12            2         2           8             1
67           11            1         1          22             1

    Match_Winner  Man_of_the_Match
0              1                 2
1              1                 4
2              1                 1
3              1                 1
4              1               144
..           ...               ...
63             1               308
64             1               334
65             1               334
66             1                31
67             1                31

[68 rows x 13 columns]

In [21]:
t=pd.read_sql('''SELECT Outcome_type,Match_Id FROM MATCH WHERE MATCH_WINNER ==1;''', conn)
print(t)

    Outcome_type  Match_Id
0              1    335987
1              1    335991
2              1    336015
3              1    336019
4              1    336022
..           ...       ...
63             1    980944
64             1    980964
65             1    980968
66             1    980994
67             1    981014

[68 rows x 2 columns]

In [22]:

t=pd.read_sql('''SELECT Outcome_type,Match_Id,MATCH_WINNER,Match_Id FROM MATCH WHERE MATCH_WINNER ==1 AND Match_Id>980944;''', conn)
print(t)

   Outcome_type  Match_Id  Match_Winner  Match_Id
0             1    980964             1    980964
1             1    980968             1    980968
2             1    980994             1    980994
3             1    981014             1    981014

In [23]:
t=pd.read_sql('''SELECT * FROM MATCH WHERE MATCH_WINNER==(SELECT MIN(City_Id) FROM City);''', conn)
print(t)

    Match_Id  Team_1  Team_2           Match_Date  Season_Id  Venue_Id  \
0     335987       2       1  2008-04-18 00:00:00          1         1
1     335991       1       8  2008-04-20 00:00:00          1         5
2     336015       1       2  2008-05-08 00:00:00          1         5
3     336019       8       1  2008-05-11 00:00:00          1         7
4     336022       1       6  2008-05-13 00:00:00          1         5
..       ...     ...     ...                  ...        ...       ...
63    980944      12       1  2016-04-24 00:00:00          9        32
64    980964       2       1  2016-05-02 00:00:00          9         1
65    980968       1       4  2016-05-04 00:00:00          9         5
66    980994       1      12  2016-05-14 00:00:00          9         5
67    981014       1      11  2016-05-22 00:00:00          9         5

    Toss_Winner  Toss_Decide  Win_Type  Win_Margin  Outcome_type  \
0             2            1         1         140             1
1             8            2         2           5             1
2             1            2         1           5             1
3             1            2         1          23             1
4             1            2         1          23             1
..          ...          ...       ...         ...           ...
63            1            1         2           2             1
64            1            1         2           5             1
65            4            1         1           7             1
66           12            2         2           8             1
67           11            1         1          22             1

    Match_Winner  Man_of_the_Match
0              1                 2
1              1                 4
2              1                 1
3              1                 1
4              1               144
..           ...               ...
63             1               308
64             1               334
65             1               334
66             1                31
67             1                31

[68 rows x 13 columns]

In [24]:
t=pd.read_sql('''SELECT * FROM MATCH WHERE MATCH_WINNER==(SELECT MIN(City_Id) FROM City);''', conn)
print(t)

    Match_Id  Team_1  Team_2           Match_Date  Season_Id  Venue_Id  \
0     335987       2       1  2008-04-18 00:00:00          1         1
1     335991       1       8  2008-04-20 00:00:00          1         5
2     336015       1       2  2008-05-08 00:00:00          1         5
3     336019       8       1  2008-05-11 00:00:00          1         7
4     336022       1       6  2008-05-13 00:00:00          1         5
..       ...     ...     ...                  ...        ...       ...
63    980944      12       1  2016-04-24 00:00:00          9        32
64    980964       2       1  2016-05-02 00:00:00          9         1
65    980968       1       4  2016-05-04 00:00:00          9         5
66    980994       1      12  2016-05-14 00:00:00          9         5
67    981014       1      11  2016-05-22 00:00:00          9         5

    Toss_Winner  Toss_Decide  Win_Type  Win_Margin  Outcome_type  \
0             2            1         1         140             1
1             8            2         2           5             1
2             1            2         1           5             1
3             1            2         1          23             1
4             1            2         1          23             1
..          ...          ...       ...         ...           ...
63            1            1         2           2             1
64            1            1         2           5             1
65            4            1         1           7             1
66           12            2         2           8             1
67           11            1         1          22             1

    Match_Winner  Man_of_the_Match
0              1                 2
1              1                 4
2              1                 1
3              1                 1
4              1               144
..           ...               ...
63             1               308
64             1               334
65             1               334
66             1                31
67             1                31

[68 rows x 13 columns]

In [25]:
t=pd.read_sql('''SELECT MIN(City_Id) FROM City;''', conn)
print(t)

   MIN(City_Id)
0             1

In [26]:

t=pd.read_sql('''SELECT * FROM Season WHERE Orange_Cap>46;''', conn)
print(t)

   Season_Id  Man_of_the_Series  Orange_Cap  Purple_Cap  Season_Year
0          1                 32         100         102         2008
1          3                133         133         131         2010
2          4                162         162         194         2011
3          5                315         162         190         2012
4          8                334         187          71         2015

In [ ]:
# Example: Fetch data from a table
cursor.execute("SELECT * FROM your_table_name")
data = cursor.fetchall()

# Example: Insert data into a table
cursor.execute("INSERT INTO your_table_name (column1, column2) VALUES (?, ?)", (value1, value2))
conn.commit()  # Commit the changes

# Example: Update data in a table
cursor.execute("UPDATE your_table_name SET column1 = ? WHERE column2 = ?", (new_value, condition))
conn.commit()  # Commit the changes

# Example: Delete data from a table
cursor.execute("DELETE FROM your_table_name WHERE column1 = ?", (condition,))
conn.commit()  # Commit the changes